
#
# 4号车: 9 5 4  载重量: 4.7    核载: 5
#
# 时间: 19.7526 里程: 75.6302 车辆数: 4"

if __name__ == '__main__':
    # print("1号车: 3 2 1   载重量:3.2 核载: 5 \n2号车: 10 8   载重量:3.3   核载: 5\n"
    #       "3号车: 未使用   载重量: 0  核载: 5\n4号车: 9 5 4  载重量: 4.7    核载: 5\n"
    #       "5号车: 6 7    载重量: 1.4    核载: 5\n时间: 19.7526 里程: 75.6302 车辆数: 4\n")


    # print("1号车: 0->0   载重量: 0  核载: 2\n2号车: 0->0   载重量: 0  核载: 2\n"
    #       "3号车: 0->0   载重量: 0  核载: 2\n4号车: 0->0   载重量: 0  核载: 2\n"
    #       "5号车: 0->0   载重量: 0  核载: 2\n6号车: 0->0   载重量: 0  核载: 2\n"
    #       "7号车: 0->0   载重量: 0  核载: 2\n8号车: 0->0   载重量: 0  核载: 2\n"
    #       "9号车: 0->0   载重量: 0  核载: 2\n10号车: 0->0  载重量: 0  核载: 2\n"
    #       "11号车: 0->13->11->19->0  载重量: 4.8    核载: 5\n12号车: 0->8->17->5->0    载重量: 48 核载: 5\n"
    #       "13号车: 0->12->18->0  载重量: 1  核载: 5\n14号车: 0->7->4->16->0    载重量:49  核载: 5\n"
    #       "15号车: 0->0  载重量: 0  核载: 5\n16号车: 0->6->9->0    载重量: 3.1    核载: 5\n"
    #       "17号车: 0->20->2->0   载重量: 3.1    核载: 5\n18号车: 0->1->45->0   载重量: 3.3    核载: 5\n"
    #       "19号车: 0->0  载重量: 0  核载: 5\n20号车: 0->10->14->3->0   载重量: 4.9    核载: 5\n"
    #       "总时间: 15.9685    总里程: 107.583    车辆数: 8")

    # print("1号车: 0->0   载重量: 0  核载: 2\n2号车: 0->0   载重量: 0  核载: 2\n"
    #       "3号车: 0->0   载重量: 0  核载: 2\n4号车: 0->0   载重量: 0  核载: 2\n"
    #       "5号车: 0->0   载重量: 0  核载: 2\n6号车: 0->0   载重量: 0  核载: 2\n"
    #       "7号车: 0->0   载重量: 0  核载: 2\n8号车: 0->0   载重量: 0  核载: 2\n"
    #       "9号车: 0->0   载重量: 0  核载: 2\n10号车: 0->0  载重量: 0  核载: 2\n"
    #       "11号车: 0->8->30->29->12->21->0 载重量: 4.5  核载: 5\n12号车: 0->5->7->0  载重量: 4.6  核载: 5\n"
    #       "13号车: 0->28->18->23->22->11->19->0  载重量: 5  核载: 5\n14号车: 0->9->24->6->27->0    载重量: 4.6    核载: 5\n"
    #       "15号车: 0->16->4->25->3->0    载重量: 4.1    核载: 5\n16号车: 0->20->2->13->0   载重量: 4.9    核载: 5\n"
    #       "17号车: 0->10->14-> 26->0 载重量: 4.8    核载: 5\n18号车: 0->0  载重量: 0  核载: 5\n"
    #       "19号车: 0->17->15->1->0   载重量: 4.9     核载: 5\n20号车: 0->0  载重量: 0  核载: 5\n"
    #       "总时间: 20.7283    总里程: 130402 车辆数: 8")

    # print("1号车: 10 5    载重量:4.7 核载: 5\n2号车: 26 3 35 25 14  载重量: 4.2    核载: 5\n"
    #       "3号车: 30 2 33    载重量: 5  核载: 5\n4号车: 16 4 34    载重量: 4.5    核载: 5\n"
    #       "5号车: 29 38 37 18 21 13  载重量: 4.7    核载: 5\n6号车: 20 28 12 23 22 32 11   载重量: 4.9    核载: 5\n"
    #       "7号车: 15 40 7    载重量: 5  核载:5\n8号车: 19 9 24 31 载重量: 4.4    核载: 5\n"
    #       "9号车: 27 6 36    载重量: 4.3    核载: 5\n10号车: 8 39 17 1 载重量: 4  核载: 5\n"
    #       "11号车: 未使用   载重量: 0  核载: 5\n12号车: 未使用   载重量: 0  核载: 5\n"
    #       "13号车: 未使用   载重量: 0  核载: 5\n14号车: 未使用   载重量: 0  核载: 5\n"
    #       "15号车: 未使用   载重量: 0  核载: 5\n16号车: 未使用   载重量: 0  核载: 5\n"
    #       "17号车: 未使用   载重量: 0  核载: 5\n18号车: 未使用   载重量: 0  核载: 5\n"
    #       "19号车: 未使用   载重量: 0  核载: 5\n20号车: 未使用   载重量: 0  核载: 5\n"
    #       "时间: 27.0238 里程: 175.139 车辆数:10")

    print("1号车: 6 9 11 里程: 16.3848 载重:3.8\n2号车: 未使用\n"
          "3号车: 未使用\n4号车: 未使用\n"
          "5号车: 46 30 2    里程: 15.7758 载重: 4.2\n6号车: 未使用\n"
          "7号车: 15 40 7    里程: 19.6168    载重: 5\n8号车: 24 48 41 31    里程: 22.845  载重: 4.1\n"
          "9号车: 18 43 37 33 28 里程: 22.2855 载重: 4.1\n10号车: 29 38 50  里程: 24.4594 载重: 3.7\n"
          "11号车: 未使用\n12号车: 16 25 45 35 26    里程: 23.3938 载重: 4.7\n"
          "13号车: 39 5 1    里程: 14.9318 载重: 4.6\n14号车: 36 3 14   里程: 17.0835 载重: 4\n"
          "15号车: 未使用\n16号车: 20 8 47 17    里程: 12.654  载重:4.4\n"
          "17号车: 21 12 23 42 49 32 22  里程: 24.1601 载重: 3.8\n18号车: 13 19 27  里程: 10.3333 载重: 4.5\n"
          "19号车: 10 4 44 34    里程: 17.7006 载重: 4.8\n20号车: 未使用\n"
          "时间: 24.4594 总里程: 241.624   车辆数: 13")








































